Привет! Меня зовут Марк.
Я обычный школьник и я ничем не отличаюсь от остальных.
Разве что... У меня совсем нет друзей.
Ну ничего, мне и одному неплохо.
Я часто прогуливаю уроки, т.к. засыпаю под утро.
Ну и тебе мой дорогой игрок нужно изменить мою жизнь, ну или не изменить.
Приятного прохождения)

НАЧАЛО.
Я уснул в 6 утра, а уроки в школе начинаются в 8. Идти мне в школу или поспать?
    1А. Я пойду в школу
    2А. Я не пойду в школу

1А. Я спокойненько просидел в школе и вернувшись домой уснул.
2А. Маман надавала мне по голове, но все было неплохо, зато выспался.

ОСНОВНАЯ ЧАСТЬ1.
Что-то я так устаю в школе, да и маман постоянно пилит.
Схожу в магазин что ли, куплю колы и чипсиков :3
Но мне так грустно и скучно одному.
Не с кем даже новую серию нового прикольного аниме :(
Ладно, справлюсь как-нибудь.

СЛЕДУЮЩИЙ ДЕНЬ.
Мне снова грустно, никого нет рядом.
Меня никто не поддерживает.
В школе надо мной все смеются и издеваются.
Я больше не хочу так.
ДОСТАЛО!
Я хочу умереть, моя жизнь бессмысленна.
Наверное никто даже не заметит.
Но перед смертью нужно сделать все чего я боялся.
Мне давно нравится девочка Ксюша, но я всегда боялся ей в этом признаться.
Как раз вот она, нужно сказать ей это. Говорить ей или нет?
    1. Я сказал ей это.
    2. Я испугался отказа и не сказал.
